//
//  ScheduleMockData.swift
//  HackPoint
//
//  Created by Maxim Butin on 25.06.2022.
//

import Foundation

class ScheduleMockData {
    
    static func getData() -> [Schedule] {
        [
            Schedule(
                day: "24 Июля, Пятница",
                event: [
                    "18:15": "Сбор участников",
                    "18:45": "Официальное открытие",
                    "19:00": "Старт работы над проектами",
                    "19:15": "Питч идей",
                    "21:00": "Ужин"
                ]
            ),
            
            Schedule(
                day: "25 Июля, Суббота",
                event: [
                    "09:00": "Завтрак",
                    "13:00": "Обед",
                    "14:00": "Экспертная сессия",
                    "19:00": "Чекпойнт",
                    "20:00": "Ужин",
                ]
            ),
            
            Schedule(
                day: "26 Июля, Воскресенье",
                event: [
                    "18:15": "Сбор участников",
                    "18:45": "Официальное открытие",
                    "19:00": "Старт работы над проектами",
                    "19:15": "Питч идей",
                    "21:00": "Ужин"
                ]
            ),
        ]
        
    }
}
